damBreak-3D/case0/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         8;

deltaT          0.0001;

writeControl    adjustableRunTime;

writeInterval   0.02;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression uncompressed;

timeFormat      general;

timePrecision   8;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;
maxAlphaCo      0.5;
maxDeltaT       0.01;

// ************************************************************************* //

functions
{

    minmaxdomain
    {
        type fieldMinMax;

        functionObjectLibs ("libfieldFunctionObjects.so");

        enabled true; //true or false

        mode component;

        writeControl timeStep;
        writeInterval 1;

        log true;

        fields (p p_rgh U alpha.water);
    }

    water_in_domain
    {
        type            volRegion;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;

        writeFields off;

        //writeControl     outputTime;
        writeControl   timeStep;
        writeInterval  1;

        log             true;

        valueOutput     false;

        regionType      all;

        operation       volIntegrate;
        fields
        (
            alpha.water
        );
    }

    probes1
    {
        type probes;
        functionObjectLibs ("libsampling.so");
        //dictionary probesDict;
        probeLocations
        (
        (0.82450002 0 0.021)
        (0.82450002 0 0.061)
        (0.82450002 0 0.101)
        (0.82450002 0 0.141)
        (0.8035 0 0.161)
        (0.7635 0 0.161)
        (0.7235 0 0.161)
        (0.6835 0 0.161)
        );
        fields
        (p p_rgh);

        writeControl       timeStep;
        writeInterval      1;
    }

};
