damBreak-3D/case0/0_org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    front
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    back
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    left
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    right
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    bottom
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    top
    {
        type            totalPressure;
        p0              uniform 0;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        value           uniform 0;
    }
    stlSurface
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

}

// ************************************************************************* //
